In [31]:
import numpy as np
import pandas as pd

In [32]:
georgyser = pd.Series([1,2,3,4,5], [6,7,8,9,0], dtype = 'int32')

In [33]:
georgyser

6    1
7    2
8    3
9    4
0    5
dtype: int32

In [34]:
georgy = pd.DataFrame(data = np.random.random(20).reshape(5,4),
                     index = ['a','b','c','d','e'],
                     columns = ['w','x','y','z'])

In [35]:
georgy

          w         x         y         z
a  0.091616  0.340283  0.972334  0.879302
b  0.781560  0.858517  0.452872  0.077927
c  0.416906  0.909668  0.415503  0.812303
d  0.225952  0.511372  0.143181  0.890415
e  0.626621  0.359831  0.259306  0.359758

In [36]:
georgy['w']

a    0.091616
b    0.781560
c    0.416906
d    0.225952
e    0.626621
Name: w, dtype: float64

In [37]:
georgy.loc['c']

w    0.416906
x    0.909668
y    0.415503
z    0.812303
Name: c, dtype: float64

In [38]:
georgy.transpose()

          a         b         c         d         e
w  0.091616  0.781560  0.416906  0.225952  0.626621
x  0.340283  0.858517  0.909668  0.511372  0.359831
y  0.972334  0.452872  0.415503  0.143181  0.259306
z  0.879302  0.077927  0.812303  0.890415  0.359758

In [39]:
import numpy as np
import pandas as pd

In [40]:
labels = ['a','b','c']        # list
my_data = [10,20,30]          # list of data
arr = np.array(my_data)       # array
d = {'a':10, 'b':20, 'c':30}  # dictionary

In [41]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [42]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [43]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [44]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [45]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [46]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [47]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [48]:
ser1 = pd.Series([1,2,3,4,5],['a','s','d','f','g'])

In [49]:
ser1

a    1
s    2
d    3
f    4
g    5
dtype: int64

In [50]:
ser2 = pd.Series([1,2,3,4,5],['a','s','g','h','j'])

In [51]:
ser2

a    1
s    2
g    3
h    4
j    5
dtype: int64

In [52]:
ser1 + ser2

a    2.0
d    NaN
f    NaN
g    8.0
h    NaN
j    NaN
s    4.0
dtype: float64

In [53]:
from numpy.random import randn

In [54]:
df = pd.DataFrame(randn(5,4),['a','s','g','h','j'],['w','x','y','z'])

In [55]:
df

          w         x         y         z
a -0.411115  0.864180 -0.880968  1.289333
s -0.765098  1.110152  0.284743  0.217461
g -0.703190  0.060952 -0.059470  0.518424
h -0.360884 -0.429103 -0.590278  0.578074
j  0.396553 -0.920760 -0.983336  0.294279

In [56]:
df['new'] = df['w'] + df['z']

In [57]:
df

          w         x         y         z       new
a -0.411115  0.864180 -0.880968  1.289333  0.878219
s -0.765098  1.110152  0.284743  0.217461 -0.547636
g -0.703190  0.060952 -0.059470  0.518424 -0.184766
h -0.360884 -0.429103 -0.590278  0.578074  0.217190
j  0.396553 -0.920760 -0.983336  0.294279  0.690832

In [58]:
df.drop('new', axis = 1)

          w         x         y         z
a -0.411115  0.864180 -0.880968  1.289333
s -0.765098  1.110152  0.284743  0.217461
g -0.703190  0.060952 -0.059470  0.518424
h -0.360884 -0.429103 -0.590278  0.578074
j  0.396553 -0.920760 -0.983336  0.294279

In [59]:
df

          w         x         y         z       new
a -0.411115  0.864180 -0.880968  1.289333  0.878219
s -0.765098  1.110152  0.284743  0.217461 -0.547636
g -0.703190  0.060952 -0.059470  0.518424 -0.184766
h -0.360884 -0.429103 -0.590278  0.578074  0.217190
j  0.396553 -0.920760 -0.983336  0.294279  0.690832

In [60]:
df.drop('new', axis = 1, inplace = True)

In [61]:
df

          w         x         y         z
a -0.411115  0.864180 -0.880968  1.289333
s -0.765098  1.110152  0.284743  0.217461
g -0.703190  0.060952 -0.059470  0.518424
h -0.360884 -0.429103 -0.590278  0.578074
j  0.396553 -0.920760 -0.983336  0.294279

In [62]:
df.shape

(5, 4)

In [63]:
df.loc['a']

w   -0.411115
x    0.864180
y   -0.880968
z    1.289333
Name: a, dtype: float64

In [64]:
df['w']

a   -0.411115
s   -0.765098
g   -0.703190
h   -0.360884
j    0.396553
Name: w, dtype: float64

In [65]:
df.iloc[0]

w   -0.411115
x    0.864180
y   -0.880968
z    1.289333
Name: a, dtype: float64

In [66]:
booldf = df>0

In [67]:
booldf

       w      x      y     z
a  False   True  False  True
s  False   True   True  True
g  False   True  False  True
h  False  False  False  True
j   True  False  False  True

In [68]:
df2 = df[booldf]

In [69]:
df2

          w         x         y         z
a       NaN  0.864180       NaN  1.289333
s       NaN  1.110152  0.284743  0.217461
g       NaN  0.060952       NaN  0.518424
h       NaN       NaN       NaN  0.578074
j  0.396553       NaN       NaN  0.294279

In [70]:
df[df>0].loc['g']['y']

nan

In [71]:
df[df['w']<0][['x','y']]

          x         y
a  0.864180 -0.880968
s  1.110152  0.284743
g  0.060952 -0.059470
h -0.429103 -0.590278

In [72]:
df2[(df2['y']==np.nan)]

Empty DataFrame
Columns: [w, x, y, z]
Index: []

In [73]:
df.reset_index()

  index         w         x         y         z
0     a -0.411115  0.864180 -0.880968  1.289333
1     s -0.765098  1.110152  0.284743  0.217461
2     g -0.703190  0.060952 -0.059470  0.518424
3     h -0.360884 -0.429103 -0.590278  0.578074
4     j  0.396553 -0.920760 -0.983336  0.294279

In [74]:
newind = 'CA NY NJ WY AR'.split()

In [75]:
df['States'] = newind

In [76]:
df

          w         x         y         z States
a -0.411115  0.864180 -0.880968  1.289333     CA
s -0.765098  1.110152  0.284743  0.217461     NY
g -0.703190  0.060952 -0.059470  0.518424     NJ
h -0.360884 -0.429103 -0.590278  0.578074     WY
j  0.396553 -0.920760 -0.983336  0.294279     AR

In [77]:
df.set_index('States', inplace = True)

In [78]:
df

               w         x         y         z
States
CA     -0.411115  0.864180 -0.880968  1.289333
NY     -0.765098  1.110152  0.284743  0.217461
NJ     -0.703190  0.060952 -0.059470  0.518424
WY     -0.360884 -0.429103 -0.590278  0.578074
AR      0.396553 -0.920760 -0.983336  0.294279

In [79]:
addind = 'g1 g1 g1 g2 g2'.split()

In [80]:
df['high index'] = addind

In [81]:
df

               w         x         y         z high index
States
CA     -0.411115  0.864180 -0.880968  1.289333         g1
NY     -0.765098  1.110152  0.284743  0.217461         g1
NJ     -0.703190  0.060952 -0.059470  0.518424         g1
WY     -0.360884 -0.429103 -0.590278  0.578074         g2
AR      0.396553 -0.920760 -0.983336  0.294279         g2

In [82]:
df.set_index('high index')

                   w         x         y         z
high index
g1         -0.411115  0.864180 -0.880968  1.289333
g1         -0.765098  1.110152  0.284743  0.217461
g1         -0.703190  0.060952 -0.059470  0.518424
g2         -0.360884 -0.429103 -0.590278  0.578074
g2          0.396553 -0.920760 -0.983336  0.294279

In [128]:
cols

MultiIndex(levels=[['g1', 'g2'], ['AR', 'CA', 'NJ', 'NY', 'WY']],
           labels=[[0, 0, 0, 1, 1], [1, 3, 2, 4, 0]],
           names=['States', 'high index'])

In [129]:
df[:]

               w         x         y         z high index States
States
CA      1.245865  0.400013 -1.176731 -0.381422         g1     CA
NY      0.721153  0.339959  0.417040  0.393285         g1     NY
NJ      0.025126 -0.513423  0.138787 -0.367225         g1     NJ
WY      1.520661 -0.101367  1.188741  1.351182         g2     WY
AR     -0.411134  1.136753 -0.301232  0.162585         g2     AR

In [130]:
df3 = pd.DataFrame(df[:],cols,['w','x','y','z'])

In [131]:
df3

                    w   x   y   z
States high index
g1     CA         NaN NaN NaN NaN
       NY         NaN NaN NaN NaN
       NJ         NaN NaN NaN NaN
g2     WY         NaN NaN NaN NaN
       AR         NaN NaN NaN NaN

In [85]:
georgy

          w         x         y         z
a  0.091616  0.340283  0.972334  0.879302
b  0.781560  0.858517  0.452872  0.077927
c  0.416906  0.909668  0.415503  0.812303
d  0.225952  0.511372  0.143181  0.890415
e  0.626621  0.359831  0.259306  0.359758

In [87]:
georgy['i']= [1,2,3,4,5]

In [88]:
georgy.set_index('i')

          w         x         y         z
i
1  0.091616  0.340283  0.972334  0.879302
2  0.781560  0.858517  0.452872  0.077927
3  0.416906  0.909668  0.415503  0.812303
4  0.225952  0.511372  0.143181  0.890415
5  0.626621  0.359831  0.259306  0.359758

In [90]:
georgy.drop('i', axis = 1, inplace = True)

In [91]:
georgy

          w         x         y         z
a  0.091616  0.340283  0.972334  0.879302
b  0.781560  0.858517  0.452872  0.077927
c  0.416906  0.909668  0.415503  0.812303
d  0.225952  0.511372  0.143181  0.890415
e  0.626621  0.359831  0.259306  0.359758

In [92]:
df

               w         x         y         z high index
States
CA     -0.411115  0.864180 -0.880968  1.289333         g1
NY     -0.765098  1.110152  0.284743  0.217461         g1
NJ     -0.703190  0.060952 -0.059470  0.518424         g1
WY     -0.360884 -0.429103 -0.590278  0.578074         g2
AR      0.396553 -0.920760 -0.983336  0.294279         g2

In [93]:
df.index

Index(['CA', 'NY', 'NJ', 'WY', 'AR'], dtype='object', name='States')